{"resposta1":"1 - Resolução do DNS\r\n2 - No caso de https, provavelmente uma resposta http 301 redirecionando o cliente da porta 80 para 443.\r\n3 - Handshake TCP\r\n4 - GET HTTP\r\n5 - Resposta do servidor com o conteúdo da página.\r\n6 - Renderização do navegador.","resposta2amaster":"ns1.ecomt4.com.br","resposta2aslave":"ns2.ecomt4.com.br","resposta2b":"Solicitei a resolução de DNS os endereços acima listados, somente três deles responderam ns2.ecomt.com.br, ns1.ecomt4.com.br e ns2.ecomt4.com.br.\r\nTendo isso em vista, a resolução de ns1.ecomt4.com.br e ns2.ecomt4.com.br eram para o mesmo IP e a resolução do ns2.ecomt.com.br apontava para outro IP.\r\nTendo como base que a resolução deveria ser a mesma, então os servidor ns1.ecomt4.com.br e ns2.ecomt4.com.br são master e slave.","resposta3":"Que não existe o e-mail do destinatário.","resposta4a":"98732.tcdn.com.br.","resposta4b":"Não deve ser registrado.","resposta4c":"Realizei uma resolução de DNS nos endereços de exemplo e vi que o domínio utilizado pela tray em suas lojas é tcdn.com.br e somente acrescentam o ID da loja como entrada deste DNS, portanto, o ID 98732 será a entrada do domínio tcdn.com.br ficando 98732.tcdn.com.br.\r\nNo domínio www.olatray.com.br não deve haver nenhum registro do tipo A, este deverá ser incluído em 98732.tcdn.com.br que é sob a gestão da empresa Tray, assim a empresa definirá qual servidor hospedará a loja do cliente e criará uma entrada apontando para o servidor\/load balancer.","resposta5":"Há várias maneira de monitorar uma aplicação, uma ótima ferramenta é o NewRelic, que monitora tempo de resposta das requests, tempo de execução de query e muitas mais. Já na versão gratuita, podemos extrair um ótimo proveito.\r\nPara monitorar a infra, posso fazer de duas maneiras, consumir o cloudwatch com um grafana ou consumir um zabbix, assim, monitoro cpu, memória, disco e etc. E posso criar regras de threshold já no grafana.\r\nUma parte muito importante é a configuração dos alertas. Gosto de utilizar push notification + email + sms para uma ação corretiva mais rápida.","resposta6":"Sobre o comando \"sudo rm -rf \/*\"\r\n\"sudo\" dá permissão root\r\n\"rm\" comando de exclusão de pastas e\/ou arquivos\r\n\"-r\" modo recursivo\r\n\"-f\" force mode\r\n\"\/*\" diretório\r\nO Sistema Operacional não iniciará.\r\nO comando apagará todos os arquivos possíveis, e com isso, apagará também os arquivos de inicialização do sistema o impossibilitando de inicializar."}